IRP/src/Catalogs/AccessGroups/AccessGroups.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
 <name>AccessGroups</name>
 <attributes>
  <name>OnlyRegisters</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <tabularSections>
  <name>Profiles</name>
  <attributes>
   <name>Profile</name>
   <type>
    <types>CatalogRef.AccessProfiles</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>Users</name>
  <attributes>
   <name>User</name>
   <type>
    <types>CatalogRef.Users</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>AddAttributes</name>
  <attributes>
   <name>Property</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>Value</name>
   <type>
    <types>Characteristic.AddAttributeAndProperty</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>ObjectAccess</name>
  <attributes>
   <name>Key</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>50</length>
    </stringQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>AccessKey</name>
   <type>
    <types>CatalogRef.AccessKey</types>
   </type>
  </attributes>
  <attributes>
   <name>ValueRef</name>
   <type>
    <types>AnyRef</types>
   </type>
  </attributes>
  <attributes>
   <name>Modify</name>
   <type>
    <types>Boolean</types>
   </type>
  </attributes>
  <attributes>
   <name>DoNotControl</name>
   <type>
    <types>Boolean</types>
   </type>
  </attributes>
  <attributes>
   <name>Value</name>
   <type>
    <types>Boolean</types>
    <types>String</types>
    <types>Date</types>
    <types>Number</types>
    <numberQualifiers>
     <precision>15</precision>
     <scale>5</scale>
    </numberQualifiers>
    <stringQualifiers>
     <length>64</length>
    </stringQualifiers>
   </type>
  </attributes>
 </tabularSections>
</mdclass:Catalog>

IRP/src/InformationRegisters/T9101A_ObjectAccessRegisters/T9101A_ObjectAccessRegisters.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
 <name>T9101A_ObjectAccessRegisters</name>
 <resources>
  <name>Value1</name>
  <type>
   <types>AnyRef</types>
  </type>
 </resources>
 <resources>
  <name>Value2</name>
  <type>
   <types>AnyRef</types>
  </type>
 </resources>
 <resources>
  <name>Value3</name>
  <type>
   <types>AnyRef</types>
  </type>
 </resources>
 <resources>
  <name>Value4</name>
  <type>
   <types>AnyRef</types>
  </type>
 </resources>
 <resources>
  <name>Value5</name>
  <type>
   <types>AnyRef</types>
  </type>
 </resources>
 <resources>
  <name>DoNotControl1</name>
  <type>
   <types>Boolean</types>
  </type>
 </resources>
 <resources>
  <name>DoNotControl2</name>
  <type>
   <types>Boolean</types>
  </type>
 </resources>
 <resources>
  <name>DoNotControl3</name>
  <type>
   <types>Boolean</types>
  </type>
 </resources>
 <resources>
  <name>DoNotControl4</name>
  <type>
   <types>Boolean</types>
  </type>
 </resources>
 <resources>
  <name>DoNotControl5</name>
  <type>
   <types>Boolean</types>
  </type>
 </resources>
 <dimensions>
  <name>AccessGroup</name>
  <type>
   <types>CatalogRef.AccessGroups</types>
  </type>
 </dimensions>
 <dimensions>
  <name>TableName</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>200</length>
   </stringQualifiers>
  </type>
 </dimensions>
 <dimensions>
  <name>UUID</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>36</length>
   </stringQualifiers>
  </type>
 </dimensions>
</mdclass:InformationRegister>

IRP/src/Catalogs/AccessGroups/ObjectModule.bsl
Procedure BeforeWrite(Cancel)
	If DataExchange.Load Then
		Return;
	EndIf;

	If Not IsNew() Then
		AdditionalProperties.Insert("OldUsersList", Ref.Users.UnloadColumn("User"));
	EndIf;

EndProcedure

Procedure OnWrite(Cancel)
	If DataExchange.Load Then
		Return;
	EndIf;
	
	If Cancel Then
		Return;
	EndIf;
	
	RegRule = InformationRegisters.T9101A_ObjectAccessRegisters.CreateRecordSet();
	RegRule.Filter.AccessGroup.Set(ThisObject.Ref);
	RegRule.Write();

	If Not ThisObject.DeletionMark Then
		For Each RegInfo In Metadata.AccumulationRegisters Do
			Module = MetadataInfo.GetManager(RegInfo.FullName()); // AccumulationRegistersManager
			Try
				AccessKeys = Module.GetAccessKey();
			Except
				// Object not connected to access subsystem
				Continue;		
			EndTry;
			
			If AccessKeys.Count() = 0 Then
				// Object not using access keys
				Continue;
			EndIf;
			
			KeyValueArray = New Array;
			For Each AccessKey In AccessKeys Do
				KeyValueArray.Add(ThisObject.ObjectAccess.Unload(New Structure("Key", AccessKey.Key)).UnloadColumn("ValueRef"));
			EndDo;
			
			Query = New Query("SELECT * FROM InformationRegister.T9101A_ObjectAccessRegisters WHERE FALSE");
			ResultTable = Query.Execute().Unload();
			For i = 0 To KeyValueArray.UBound() Do
				TmpTable = ResultTable.Copy();
				ValueArray = KeyValueArray[i];
				If ValueArray.Count() = 0 Then
					Continue;
				EndIf;
				ResultTable.Clear();
				For Each Value In ValueArray Do
					If TmpTable.Count() > 0 Then
						For Each ResRow In TmpTable Do
							NewRow = ResultTable.Add();
							FillPropertyValues(NewRow, ResRow);
							NewRow["Value" + (i + 1)] = Value;
						EndDo;
					Else
						NewRow = ResultTable.Add();
						NewRow["Value" + (i + 1)] = Value;
					EndIf;
				EndDo;
			EndDo;
			
			For Each Row In ResultTable Do
				
				Reg = InformationRegisters.T9101A_ObjectAccessRegisters.CreateRecordManager();
				FillPropertyValues(Reg, Row);
				Reg.AccessGroup = ThisObject.Ref;
				Reg.TableName = RegInfo.FullName();
				Reg.UUID = String(New UUID);
				Reg.Write();
			EndDo;
			
		EndDo;
	EndIf;
EndProcedure

Procedure BeforeDelete(Cancel)
	If DataExchange.Load Then
		Return;
	EndIf;
EndProcedure
